clean up memento pattern
